paperwork/polygon-styles.dot
digraph polygon {
  node [shape=record];

  // inputs
  globalStyle [label="globalStyle\n\{k: v\}", color=blue]
  layerStyle [label="layerStyle\n\{k: v\}", color=blue]
  featureStyle [label="featureStyle\n\{k: v\}", color=blue]
  feature [label="feature\nol/Feature", color=blue]
  resolution [label="resolution\nNumber", color=blue]
  properties [label="properties\n\{k: v\}"];
  geometry [label="geometry\nol/geom/Geometry"]
  sidc [label="sidc\nString"]
  colorScheme [label="colorScheme\nString"]
  schemeStyle [label="schemeStyle\n\{k: v\}"]
  effectiveStyle [label="effectiveStyle\n\{k: v\}"]
  read [label="read\nol/Geometry =\> jts/Geomery"]
  write [label="write\njts/Geometry =\> ol/Geomery"]
  _pointResolution [label="_pointResolution\nNumber =\> Number"]
  pointResolution [label="pointResolution\nNumber"]
  // utmGeometry [label="utmGeometry\njts/Geometry"]
  parameterizedSIDC [label="parameterizedSIDC\nString"]
  labels [label="labels\n[\{k: v\}]"]
  evalSync [label="evalSync\n\{k: v\} =\> \{k: v\}"]
  simplifiedGeometry [label="simplifiedGeometry\nol/Geometry"]
  lineSmoothing [label="lineSmoothing\nBoolean"]
  smoothenedGeometry [label="smoothenedGeometry\nBoolean"]
  utmSmoothenedGeometry [label="utmSmoothenedGeometry\njts/Geometry"]
  context [label="context\n\{k: v\}"]
  shape [label="shape\n\{k: v\}"]
  placement [label="placement\n\{k: v\} =\> \{k: v\}"]
  styles [label="styles\n[\{k: v\}]"]
  style [label="style\nol/Style", color=red]

  // shared
  feature -> properties
  properties -> geometry
  properties -> sidc
  globalStyle -> colorScheme
  layerStyle -> colorScheme
  featureStyle -> colorScheme
  sidc -> schemeStyle
  colorScheme -> schemeStyle
  globalStyle -> effectiveStyle
  schemeStyle -> effectiveStyle
  layerStyle -> effectiveStyle
  featureStyle -> effectiveStyle
  effectiveStyle -> styleRegistry

  // shape
  geometry -> read
  geometry -> write
  geometry -> _pointResolution
  _pointResolution -> pointResolution
  resolution -> pointResolution
  read -> utmGeometry
  geometry -> utmGeometry
  sidc -> parameterizedSIDC
  properties -> evalSync
  sidc -> evalSync
  geometry -> simplifiedGeometry
  resolution -> simplifiedGeometry
  effectiveStyle -> lineSmoothing
  lineSmoothing -> smoothenedGeometry
  simplifiedGeometry -> smoothenedGeometry
  smoothenedGeometry -> utmSmoothenedGeometry
  read -> utmSmoothenedGeometry
  utmSmoothenedGeometry -> placement
  utmSmoothenedGeometry -> context
  parameterizedSIDC -> labels
  evalSync -> labels
  placement -> labels
  pointResolution -> context
  context -> shape
  parameterizedSIDC -> shape
  labels -> styles
  shape -> styles
  styles -> style
  styleRegistry -> style
  write -> style
}
